app/controllers/menus_controller.rb

  def index
    @menus = Menu.all
---
SELECT `menus`.* FROM `menus`

  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save
---
INSERT INTO `menus` (`created_at`, `description`, `restaurant_id`, `title`, `updated_at`) VALUES ('2014-10-31 20:38:09', '', 2, '', '2014-10-31 20:38:09')

    def set_menu
      @menu = Menu.find(params[:id])
---
SELECT  `menus`.* FROM `menus`  WHERE `menus`.`id` = 2 LIMIT 1