app/controllers/restaurants_controller.rb

SELECT  `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 5  ORDER BY `organizations`.`id` ASC LIMIT 1
SELECT `restaurants`.* FROM `restaurants`
---
  def index
    @organization = current_user.organizations.first.name
    if params[:id].present?
      @restaurants = @tenant.restaurants.find(params[:id])
    else
      @restaurants = Restaurant.all

SELECT `menus`.* FROM `menus` WHERE `menus`.`restaurant_id` = 2
---
  def show
    @menus = Menu.where(:restaurant_id => @restaurant.id)

SELECT `menus`.* FROM `menus`  WHERE `menus`.`restaurant_id` = 2
---
  def export_menus
    @menus = Menu.where(:restaurant_id => params[:restaurant_id])

SELECT  `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 4  ORDER BY `organizations`.`id` ASC LIMIT 1
---
  def new
    @restaurant = Restaurant.new
    @organization = current_user.organizations.first.id

SELECT  `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 4  ORDER BY `organizations`.`id` ASC LIMIT 1
INSERT INTO `restaurants` (`created_at`, `description`, `name`, `organization_id`, `slug`, `updated_at`) VALUES ('2014-10-31 16:31:05', '', 'kackbar2', 4, 'kackbar2', '2014-10-31 16:31:05')
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.organization_id = current_user.organizations.first.id

    respond_to do |format|
      if @restaurant.save

DELETE FROM `restaurants` WHERE `restaurants`.`id` = 1
---
  def destroy
    @restaurant.destroy

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 0 LIMIT 1
---
    def set_restaurant
      @restaurant = Restaurant.friendly.find(params[:id])